In [1]:
#encripted from biological nerve cells to python code by ram param, on 5th may 2023
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn

### both decision tree and logistic regression is highly used in classification. mainly decision tree is sometime written as a part of regression learning of supervised ml but it is predominanlty used in classification type of supervised learning.

#### decision tree is for titanic like datasets where we have to make SELECTION based on some fields

#### logistic regression is for character recoznition(mapping pixel to logit function), yes/no types where outcomes is in predefined set.

# Simple salary datasets for decision tree

In [3]:
df = pd.read_csv("decision_tree.tsv", sep="\t")
df.columns

Index(['company ', 'job ', 'degree ', 'salary_more_then_100k'], dtype='object')

In [6]:
#as data is in tab sep format so, while reading it reads space after it also
#remoing space after col name
df.columns = [i.rstrip() for i in df.columns]

In [16]:
df

        company                   job      degree  salary_more_then_100k
0       google       sales executive   bachelors                       0
1       google       sales executive     masters                       0
2       google      business manager   bachelors                       1
3       google      business manager     masters                       1
4       google   computer programmer   bachelors                       0
5       google   computer programmer     masters                       1
6   abc pharma       sales executive     masters                       0
7   abc pharma   computer programmer   bachelors                       0
8   abc pharma      business manager   bachelors                       0
9   abc pharma      business manager     masters                       1
10    facebook       sales executive   bachelors                       1
11    facebook       sales executive     masters                       1
12    facebook      business manager   bachelors                       1
13    facebook      business manager     masters                       1
14    facebook   computer programmer   bachelors                       1
15    facebook   computer programmer     masters                       1

In [15]:
from sklearn import preprocessing

In [64]:
#encoding the categorical col
df["company"] = sklearn.preprocessing.LabelEncoder().fit_transform(df.iloc[:,0])
df["job"] = sklearn.preprocessing.LabelEncoder().fit_transform(df.iloc[:,1])
df["degree"] = sklearn.preprocessing.LabelEncoder().fit_transform(df.iloc[:,2])
df

    company  job  degree  salary_more_then_100k
0         2    2       0                      0
1         2    2       1                      0
2         2    0       0                      1
3         2    0       1                      1
4         2    1       0                      0
5         2    1       1                      1
6         0    2       1                      0
7         0    1       0                      0
8         0    0       0                      0
9         0    0       1                      1
10        1    2       0                      1
11        1    2       1                      1
12        1    0       0                      1
13        1    0       1                      1
14        1    1       0                      1
15        1    1       1                      1

In [68]:
from sklearn import tree

In [76]:
dir(tree)

['BaseDecisionTree',
 'DecisionTreeClassifier',
 'DecisionTreeRegressor',
 'ExtraTreeClassifier',
 'ExtraTreeRegressor',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_classes',
 '_criterion',
 '_export',
 '_reingold_tilford',
 '_splitter',
 '_tree',
 '_utils',
 'export_graphviz',
 'export_text',
 'plot_tree']

In [101]:
#model training
# as dataset is small so use all in training
dt_model = tree.DecisionTreeClassifier()
dt_model.fit(df.iloc[:,:3], df.iloc[:,3])

DecisionTreeClassifier()

In [104]:
dt_model.predict([[1,1,1]])

C:\Users\ram11\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [312]:
#highest score is 1
dt_model.score(df.iloc[:,:3], df.iloc[:,3])

1.0

# Titanic Datasets

in the below dataset, the age column has some nan value. so, we have to first remove it and then push data into the model.
otherwise, the model will give error for nan values.
to remove the nan ages, best way is to take the non-nan age's row and apply some model to find the age. like take survived, Pclass, and fare to find the age. i had taken linear regression but getting score of 20% in training data itself.
so i left the age column.

## without age coloumn in model

In [108]:
df = pd.read_csv("titanic.csv", index_col=[0])
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [247]:
df1 = df[["Survived","Pclass","Sex","Fare","SibSp","Parch","Embarked"]]
df1.head()

             Survived  Pclass     Sex     Fare  SibSp  Parch Embarked
PassengerId
1                   0       3    male   7.2500      1      0        S
2                   1       1  female  71.2833      1      0        C
3                   1       3  female   7.9250      0      0        S
4                   1       1  female  53.1000      1      0        S
5                   0       3    male   8.0500      0      0        S

In [248]:
df1["Sex"] = sklearn.preprocessing.LabelEncoder().fit_transform(df["Sex"])
df1["Embarked"] = sklearn.preprocessing.LabelEncoder().fit_transform(df["Embarked"])
df1.head()

C:\Users\ram11\AppData\Local\Temp\ipykernel_7612\112740964.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Sex"] = sklearn.preprocessing.LabelEncoder().fit_transform(df["Sex"])
C:\Users\ram11\AppData\Local\Temp\ipykernel_7612\112740964.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Embarked"] = sklearn.preprocessing.LabelEncoder().fit_transform(df["Embarked"])

             Survived  Pclass  Sex     Fare  SibSp  Parch  Embarked
PassengerId
1                   0       3    1   7.2500      1      0         2
2                   1       1    0  71.2833      1      0         0
3                   1       3    0   7.9250      0      0         2
4                   1       1    0  53.1000      1      0         2
5                   0       3    1   8.0500      0      0         2

In [249]:
dec_model = sklearn.tree.DecisionTreeClassifier().fit(df1.iloc[:,1:], df1.iloc[:,0])
dec_model

DecisionTreeClassifier()

In [250]:
dec_model.score(df1.iloc[:,1:], df1.iloc[:,0])

0.9248035914702581

# Taking age in model (removed NaN value)

In [309]:
df2 = df[["Survived","Pclass","Sex","Age","Fare","SibSp","Parch","Embarked"]]
df2.drop(df2[df2["Age"].isna()].index, inplace=True)
df2["Sex"] = sklearn.preprocessing.LabelEncoder().fit_transform(df2["Sex"])
df2["Embarked"] = sklearn.preprocessing.LabelEncoder().fit_transform(df2["Embarked"])
dec_model2 = sklearn.tree.DecisionTreeClassifier().fit(df2.iloc[:,1:], df2.iloc[:,0])
dec_model2.score(df2.iloc[:,1:], df2.iloc[:,0])

C:\Users\ram11\AppData\Local\Temp\ipykernel_7612\549156651.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(df2[df2["Age"].isna()].index, inplace=True)
C:\Users\ram11\AppData\Local\Temp\ipykernel_7612\549156651.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Sex"] = sklearn.preprocessing.LabelEncoder().fit_transform(df2["Sex"])
C:\Users\ram11\AppData\Local\Temp\ipykernel_7612\549156651.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Embarked"] = sklearn.preprocessing.LabelEncoder().fit_transform(df2["Embarked"])

0.9859943977591037